Repository: ipozow/Capitalist-World-CLI
Catalog: Capitalist World CLI/Localizable.xcstrings
Source language: en
Languages: es

# app.ready
source: Capitalist World CLI ready. Type '%@' to view options.
es: Capitalist World CLI listo. Escribe '%@' para ver opciones.

# command.abandon.aliases
source: abandon,abandonar
es: abandonar,abandon

# command.abandon.primary
source: abandon
es: abandonar

# command.exit.aliases
source: exit,quit,salir
es: salir,exit,quit

# command.exit.primary
source: exit
es: salir

# command.help.aliases
source: help,ayuda
es: ayuda,help

# command.help.primary
source: help
es: ayuda

# command.overview.header
source: Available commands:
es: Comandos disponibles:

# command.save.aliases
source: save,guardar
es: guardar,save

# command.save.primary
source: save
es: guardar

# command.start.aliases
source: start,begin,iniciar
es: iniciar,start,begin

# command.start.primary
source: start
es: iniciar

source: Current game: %@
es: Partida actual: %@

# default.game.name
source: Game %@
es: Partida %@

# error.activeGame
source: There is already an active game (%@). Use '%@' or '%@' before starting another.
es: Ya hay una partida activa (%@). Usa '%@' o '%@' antes de iniciar otra.

# error.coreData
source: Failed to load Core Data: %@
es: Error al cargar Core Data: %@

# error.dataDirectory
source: Could not prepare the data folder: %@
es: No se pudo preparar la carpeta de datos: %@

# error.noActiveGame
source: No active game found. Use '%@ %@' to begin.
es: No hay una partida activa. Usa '%@ %@' para comenzar.

# error.persistence
source: Could not save the game: %@
es: No se pudo guardar la partida: %@

# exit.warning
source: An active game is running: %@. Remember to save before exiting.
es: Hay una partida activa: %@. No olvides guardar antes de salir.

source: Exiting...
es: Saliendo...

# game.abandoned
source: Game abandoned. Use '%@' to begin another.
es: Partida abandonada. Usa '%@' para comenzar otra.

source: Game saved: %@
es: Partida guardada: %@

source: Game started: %@
es: Partida iniciada: %@

# input.ended
source: Input ended. Exiting...
es: Entrada finalizada. Saliendo...

# placeholder.name
source: <name>
es: <nombre>

# previous.loaded
source: Previous game loaded: %@
es: Partida previa cargada: %@

# status.summary
source: Game: %@ | Player: %@ | Company: %@ | Balance: %@ | Last saved: %@
es: Partida: %@ | Jugador: %@ | Empresa: %@ | Saldo: %@ | Último guardado: %@

# unknown.command
source: Command pending implementation: %@
es: Comando pendiente de implementar: %@

# command.list.primary
source: games
es: partidas

# command.list.aliases
source: games,partidas,list
es: partidas,games,list

# games.header
source: Saved games:
es: Partidas registradas:

# games.empty
source: No games available yet. Use '%@' to create one.
es: Aún no hay partidas disponibles. Usa '%@' para crear una.

# status.label.active
source: Active
es: Activa

# status.label.abandoned
source: Abandoned
es: Abandonada

# status.label.unknown
source: Unknown
es: Desconocido

# error.invalidSelection
source: No game matches '%@'. Try '%@' to list games.
es: No se encontró partida para '%@'. Usa '%@' para ver el listado.

# error.noGames
source: No games available yet. Use '%@' to create one.
es: Aún no hay partidas disponibles. Usa '%@' para crear una.

# command.load.primary
source: load
es: cargar

# command.load.aliases
source: load,cargar
es: cargar,load

# load.success
source: Game loaded: %@
es: Partida cargada: %@

# load.missingArgument
source: Provide a game index or ID. Usage: '%@ <value>'. Try '%@' to list games.
es: Indica un índice o ID de partida. Uso: '%@ <valor>'. Usa '%@' para listar partidas.

# start.prompt.playerName
source: Enter player name:
es: Ingresa el nombre del jugador:

# start.prompt.companyName
source: Enter company name:
es: Ingresa el nombre de la empresa:

# start.error.emptyInput
source: Value cannot be empty. Please try again.
es: El valor no puede estar vacío. Inténtalo nuevamente.

# status.label.unknownPlayer
source: Unknown player
es: Jugador desconocido

# status.label.unknownCompany
source: Unknown company
es: Empresa desconocida

# status.label.unknownGame
source: Unnamed game
es: Partida sin nombre
